from chatterbot.trainers import ListTrainer
from chatterbot import ChatBot

chatbot = ChatBot("นภา")
conversation = [
"สวัสดีค่ะ",
"ดีค่ะนักเรียน",
"เป็นยังไงบ้างคะ",
"ครูสบายดี",
"นักเรียนอายุเท่าไหร่",
"นักเรียนมีใบแปะก๊วยมั้ย",
"เทพนรินทร์ ลาพาสระน้อย",
"ครูอายุ 50 ปีแล้วค่ะ",
"หัวหน้าอยู่ไหน",
"ทำการบ้านครูกันรึยัง",
"ครูได้ให้งานรึเปล่า",
"เข้าใจไหมคะนักเรียน",
"ทำไมไม่มีใครตอบครูเลย",
"ดีมากค่ะ",
"นักเรียนยังอยู่ไหมคะ",
"ไหนใครโดดเรียน",
"ครูเข้าใจนักเรียนคะ",
"ไม่ต้องเถียงครูค่ะ",
"สวัสดี ครูชื่อลูกชิ้น",
"ยินดีที่ได้รู้จัก",
"นักเรียนเป็นไงบ้าง?",
"สบายดีแล้วนักเรียนแล้วนักเรียนล่ะ?",
"ครูไม่เป็นไร แล้วนักเรียน",
"นักเรียนมาจากที่ไหน?",
"ครูมาจากประเทศไทย",
"นักเรียนอายุเท่าไร?",
"วันเกิดนักเรียนเมื่อไหร่",
"17 ส.ค. 2514",
"นักเรียนมีโทรศัพท์มือถือหรือไม่",
"ใช่",
"ไม่",
"นักเรียนอยู่ที่นี่มานานเท่าไหร่แล้ว",
"นักเรียนเป็นคนสัญชาติอะไร",
"ทุกคนสามารถเป็นเพื่อนของครูได้",
"ก็เลยได้เจอกันอีกใช่ไหม",
"นักเรียนทำอะไรอยู่",
"การฝึกอบรม",
"ใครคือนักร้องที่นักเรียนชื่นชอบ?",
"ใครคือ Pai",
"นักเรียนชอบเพลงประเภทไหน?",
"ครูชอบเพลงป๊อป",
"กีฬาที่ครูชอบคือแชร์บอล",
"นักเรียนชอบสัตว์อะไร",
"ครูชอบแมว",
"นักเรียนชอบผลไม้ชนิดไหน",
"นักเรียนชอบกล้วยไหม",
"ครูชอบดูทีวี",
"ครูชอบดูหนัง",
"ครูสนุกกับการเดินทาง",
"ครูสนใจการถ่ายภาพ",
"นักเรียนพูดได้กี่ภาษา?",
"นักเรียนร้องเพลงได้ไหม?",
"นักเรียนอยากกินอะไร?",
"นักเรียนกำลังมองหาอะไร?",
"ครูกำลังมองหารองเท้า",
"ครูแค่มอง",
"ถูกต้อง",
"ไม่ถูกต้อง",
"ครูจะเอาอันนี้",
"ครูชอบมันมาก",
"ให้ไปส่งไหม",
"ครูสบายดี",
"ขอบใจจ้ะนักเรียน",
"ขอบคุณจ้ะ",
"นั่นไม่ยุติธรรม",
"ยินดี"
]

trainer = ListTrainer(chatbot)
trainer.train(conversation)

while(True):
    text = str(input("You : "))
    response = chatbot.get_response(text)
    output = "Napha : " + str(response) + "\n"
    print(output)